OpenFOAMfiles/run/city/7_4m:s/LoD2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    x0
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          3740;
        startFace       1032892;
    }
    y0
    {
        type            patch;
        nFaces          2068;
        startFace       1036632;
    }
    x1
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          3740;
        startFace       1038700;
    }
    y1
    {
        type            patch;
        nFaces          2068;
        startFace       1042440;
    }
    water
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          15980;
        startFace       1044508;
    }
    sky
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          15980;
        startFace       1060488;
    }
)

// ************************************************************************* //
