OpenFOAMfiles/run/city/7_4m:s/LoD2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     treeFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable true;

libs ("treekEpsilon.so" "treeFoam.so" "libatmosphericModels.so" "libUserfieldFunctionObjects.so" "libUserturbulenceModels.so");

functions
{
    #includeFunc  residuals 
    #includeFunc  surfaces
    
    firstCellHeight1
    {
        type        firstCellHeight;
        libs        ("libfieldFunctionObjects.so");
        writeFields       false;
    }
}

// ************************************************************************* //
